## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "canadacentral"
      + name     = "040982662-a12-rg"
      + tags     = {
          + "created_at"  = "2025-03-29"
          + "environment" = "production"
          + "owner"       = "akhiljos256"
          + "project"     = "cst8918-lab12"
        }
    }

  # azurerm_subnet.subnet will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "040982662-a12-subnet"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "040982662-a12-rg"
      + virtual_network_name                           = "040982662-a12-vnet"
    }

  # azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "canadacentral"
      + name                = "040982662-a12-vnet"
      + resource_group_name = "040982662-a12-rg"
      + subnet              = (known after apply)
      + tags                = {
          + "created_at"  = "2025-03-29"
          + "environment" = "production"
          + "owner"       = "akhiljos256"
          + "project"     = "cst8918-lab12"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + resource_group_location = "canadacentral"
  + resource_group_name     = "040982662-a12-rg"
```
</details>